# Module: Pandas Assignments
## Lesson: Pandas
### Assignment 1: DataFrame Creation and Indexing

1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.
2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

### Assignment 2: DataFrame Operations

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Add a new column that is the product of the first two columns.
2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

### Assignment 3: Data Cleaning

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Introduce some NaN values. Fill the NaN values with the mean of the respective columns.
2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. Drop the rows with any NaN values.

### Assignment 4: Data Aggregation

1. Create a Pandas DataFrame with 2 columns: 'Category' and 'Value'. Fill the 'Category' column with random categories ('A', 'B', 'C') and the 'Value' column with random integers. Group the DataFrame by 'Category' and compute the sum and mean of 'Value' for each category.
2. Create a Pandas DataFrame with 3 columns: 'Product', 'Category', and 'Sales'. Fill the DataFrame with random data. Group the DataFrame by 'Category' and compute the total sales for each category.

### Assignment 5: Merging DataFrames

1. Create two Pandas DataFrames with a common column. Merge the DataFrames using the common column.
2. Create two Pandas DataFrames with different columns. Concatenate the DataFrames along the rows and along the columns.

### Assignment 6: Time Series Analysis

1. Create a Pandas DataFrame with a datetime index and one column filled with random integers. Resample the DataFrame to compute the monthly mean of the values.
2. Create a Pandas DataFrame with a datetime index ranging from '2021-01-01' to '2021-12-31' and one column filled with random integers. Compute the rolling mean with a window of 7 days.

### Assignment 7: MultiIndex DataFrame

1. Create a Pandas DataFrame with a MultiIndex (hierarchical index). Perform some basic indexing and slicing operations on the MultiIndex DataFrame.
2. Create a Pandas DataFrame with MultiIndex consisting of 'Category' and 'SubCategory'. Fill the DataFrame with random data and compute the sum of values for each 'Category' and 'SubCategory'.

### Assignment 8: Pivot Tables

1. Create a Pandas DataFrame with columns 'Date', 'Category', and 'Value'. Create a pivot table to compute the sum of 'Value' for each 'Category' by 'Date'.
2. Create a Pandas DataFrame with columns 'Year', 'Quarter', and 'Revenue'. Create a pivot table to compute the mean 'Revenue' for each 'Quarter' by 'Year'.

### Assignment 9: Applying Functions

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Apply a function that doubles the values of the DataFrame.
2. Create a Pandas DataFrame with 3 columns and 6 rows filled with random integers. Apply a lambda function to create a new column that is the sum of the existing columns.

### Assignment 10: Working with Text Data

1. Create a Pandas Series with 5 random text strings. Convert all the strings to uppercase.
2. Create a Pandas Series with 5 random text strings. Extract the first three characters of each string.

----------------------------------------------------------------------------------------------------

In [1]:
import pandas as pd
import numpy as np

#### Assignment 1: DataFrame Creation and Indexing
1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.
2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

In [2]:
#Task 1
df = pd.DataFrame(
    np.random.randint(1, 100, size = (6, 4)),
    columns = ['A', 'B', 'C', 'D']
)
print("Original DataFrame:")
display(df)

df.set_index('A', inplace=True)
print("DataFrame with new index:")
display(df)

Original DataFrame:

    A   B   C   D
0  48  89  40  35
1  44  66   6  78
2  59  98  44  13
3   8  63  80  23
4  34  49  55  36
5  66  59  49  83

DataFrame with new index:

     B   C   D
A
48  89  40  35
44  66   6  78
59  98  44  13
8   63  80  23
34  49  55  36
66  59  49  83

In [3]:
#Task 2
df = pd.DataFrame(
    np.random.randint(1, 100, size = (3, 3)),
    columns = ['A', 'B', 'C'],
    index = ['X', 'Y', 'Z']
)
print("Original DataFrame:")
display(df)

print(f"Element at row Y and column B: {df.at['Y', 'B']}")

Original DataFrame:

    A   B   C
X  91  29  82
Y  17   9  22
Z  16  67  59

Element at row Y and column B: 9

#### Assignment 2: DataFrame Operations
1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Add a new column that is the product of the first two columns.
2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

In [4]:
#Task 1
df = pd.DataFrame(
    np.random.randint(1, 100, size = (5, 3)),
    columns = ['A', 'B', 'C']
)
print("Original DataFrame:")
display(df)

df['D'] = df['A'] * df['B']
print("DataFrame with new column:")
display(df)

Original DataFrame:

    A   B   C
0   8  56  91
1  20  79  79
2  83  61  87
3  22  19  70
4  55  84  29

DataFrame with new column:

    A   B   C     D
0   8  56  91   448
1  20  79  79  1580
2  83  61  87  5063
3  22  19  70   418
4  55  84  29  4620

In [5]:
#Task 2
df = pd.DataFrame(
    np.random.randint(1, 10, size = (4, 3)),
    columns = ['A', 'B', 'C'],
    index = ['Row1', 'Row2', 'Row3', 'Row4']
)
print("Original DataFrame:")
display(df)

row_sum = df.sum(axis = 1)
col_sum = df.sum(axis = 0)

print("Row-wise sum:")
display(row_sum)
print("Column-wise sum:")
display(col_sum)

Original DataFrame:

      A  B  C
Row1  7  4  5
Row2  2  2  3
Row3  3  8  8
Row4  1  4  3

Row-wise sum:

Row1    16
Row2     7
Row3    19
Row4     8
dtype: int64

Column-wise sum:

A    13
B    18
C    19
dtype: int64

#### Assignment 3: Data Cleaning

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Introduce some NaN values. Fill the NaN values with the mean of the respective columns.
2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. Drop the rows with any NaN values.

In [6]:
#Task 1
df = pd.DataFrame(np.random.randint(1, 100, size=(5, 3)), columns=['A', 'B', 'C'])
print("Original DataFrame:")
display(df)

df.iloc[0, 1] = np.nan
df.iloc[2, 2] = np.nan
df.iloc[4, 0] = np.nan
print("DataFrame with NaN values:")
display(df)

df.fillna(df.mean(), inplace=True)
print("DataFrame with NaN values filled:")
display(df)

Original DataFrame:

    A   B   C
0  24  69  37
1  71   6  74
2  16  98  69
3  67  41   4
4  47  70  21

DataFrame with NaN values:

      A     B     C
0  24.0   NaN  37.0
1  71.0   6.0  74.0
2  16.0  98.0   NaN
3  67.0  41.0   4.0
4   NaN  70.0  21.0

DataFrame with NaN values filled:

      A      B     C
0  24.0  53.75  37.0
1  71.0   6.00  74.0
2  16.0  98.00  34.0
3  67.0  41.00   4.0
4  44.5  70.00  21.0

In [7]:
#Task 2
df = pd.DataFrame(
    np.random.randint(1, 100, size=(6, 4)), 
    columns=['A', 'B', 'C', 'D'],
    index=['Row1', 'Row2', 'Row3', 'Row4', 'Row5', 'Row6']
)
print("Original DataFrame:")
display(df)

df.iloc[0, 1] = np.nan
df.iloc[2, 2] = np.nan
df.iloc[4, 0] = np.nan
print("DataFrame with NaN values:")
display(df)

df.dropna(inplace=True)
print("DataFrame with NaN values Dropped:")
display(df)

Original DataFrame:

       A   B   C   D
Row1  71  56  11   4
Row2  64  89  87  84
Row3  54  48  56  96
Row4  76  96  92  39
Row5  32   2  45  88
Row6  61  84  41  52

DataFrame with NaN values:

         A     B     C   D
Row1  71.0   NaN  11.0   4
Row2  64.0  89.0  87.0  84
Row3  54.0  48.0   NaN  96
Row4  76.0  96.0  92.0  39
Row5   NaN   2.0  45.0  88
Row6  61.0  84.0  41.0  52

DataFrame with NaN values Dropped:

         A     B     C   D
Row2  64.0  89.0  87.0  84
Row4  76.0  96.0  92.0  39
Row6  61.0  84.0  41.0  52

#### Assignment 4: Data Aggregation

1. Create a Pandas DataFrame with 2 columns: 'Category' and 'Value'. Fill the 'Category' column with random categories ('A', 'B', 'C') and the 'Value' column with random integers. Group the DataFrame by 'Category' and compute the sum and mean of 'Value' for each category.
2. Create a Pandas DataFrame with 3 columns: 'Product', 'Category', and 'Sales'. Fill the DataFrame with random data. Group the DataFrame by 'Category' and compute the total sales for each category.

In [8]:
#Task 1
df = pd.DataFrame({
    'Category':np.random.choice(['A','B','C'], size=10),
    'Value':np.random.randint(1,100,size=10)
})
print("Original DataFrame:")
display(df)

grouped_df = df.groupby('Category')['Value'].agg(['sum', 'mean'])
print("Grouped DataFrame:")
display(grouped_df)

Original DataFrame:

  Category  Value
0        B     83
1        B     34
2        B     24
3        C     63
4        A     74
5        A     89
6        B     84
7        C     26
8        A     62
9        A     78

Grouped DataFrame:

          sum   mean
Category
A         303  75.75
B         225  56.25
C          89  44.50

In [27]:
#Task2
df = pd.DataFrame({
    'Product':np.random.choice(['Product1', 'Product2', 'Product3'], size=10),
    'Category':np.random.choice(['A','B','C'], size=10),
    'Sales':np.random.randint(1, 100 ,size=10)
})
print("Original DataFrame:")
display(df)

grouped_df2 = df.groupby(['Product','Category'])['Sales'].sum()
print("Total sales as per Product and Category:")
display(grouped_df2)

Original DataFrame:

    Product Category  Sales
0  Product3        C     44
1  Product3        C     17
2  Product1        B     52
3  Product2        B     93
4  Product3        C     17
5  Product1        A      9
6  Product3        C     39
7  Product3        B     23
8  Product3        B      1
9  Product2        B     21

Total sales as per Product and Category:

Product   Category
Product1  A             9
          B            52
Product2  B           114
Product3  B            24
          C           117
Name: Sales, dtype: int32

#### Assignment 5: Merging DataFrames

1. Create two Pandas DataFrames with a common column. Merge the DataFrames using the common column.
2. Create two Pandas DataFrames with different columns. Concatenate the DataFrames along the rows and along the columns.

In [7]:
#Task1
df1 = pd.DataFrame({'Key': ['A', 'B', 'C', 'D'], 'Value1': np.random.randint(1, 100, size=4)})
df2 = pd.DataFrame({'Key': ['A', 'B', 'C', 'E'], 'Value2': np.random.randint(1, 100, size=4)})
print("DataFrame 1:")
display(df1)
print("DataFrame 2:")
display(df2)

merged = pd.merge(df1, df2, on='Key')
print("Merged DataFrame:")
display(merged)

DataFrame 1:

  Key  Value1
0   A      54
1   B      68
2   C      31
3   D      72

DataFrame 2:

  Key  Value2
0   A      40
1   B      57
2   C      69
3   E      62

Merged DataFrame:

  Key  Value1  Value2
0   A      54      40
1   B      68      57
2   C      31      69

In [13]:
#Task2
df1 = pd.DataFrame({'A': np.random.randint(1, 100, size=3), 'B': np.random.randint(1, 100, size=3)})
df2 = pd.DataFrame({'C': np.random.randint(1, 100, size=3), 'D': np.random.randint(1, 100, size=3)})
print("DataFrame 1:")
display(df1)
print("DataFrame 2:")
display(df2)

concat_rows = pd.concat([df1, df2], axis=0)
print("Concatenated DataFrame (rows):")
display(concat_rows)

concat_columns = pd.concat([df1, df2], axis=1)
print("Concatenated DataFrame (columns):")
display(concat_columns)

DataFrame 1:

    A   B
0  96  91
1  14   8
2  42  49

DataFrame 2:

    C   D
0  57  83
1  76  69
2  65  80

Concatenated DataFrame (rows):

      A     B     C     D
0  96.0  91.0   NaN   NaN
1  14.0   8.0   NaN   NaN
2  42.0  49.0   NaN   NaN
0   NaN   NaN  57.0  83.0
1   NaN   NaN  76.0  69.0
2   NaN   NaN  65.0  80.0

Concatenated DataFrame (columns):

    A   B   C   D
0  96  91  57  83
1  14   8  76  69
2  42  49  65  80

#### Assignment 6: Time Series Analysis

1. Create a Pandas DataFrame with a datetime index and one column filled with random integers. Resample the DataFrame to compute the monthly mean of the values.
2. Create a Pandas DataFrame with a datetime index ranging from '2021-01-01' to '2021-12-31' and one column filled with random integers. Compute the rolling mean with a window of 7 days.

In [9]:
#Task 1
date_rng = pd.date_range(start='2022-01-01', end='2022-12-31', freq='D')
df = pd.DataFrame(date_rng, columns=['date'])
df['data'] = np.random.randint(0,100,size=(len(date_rng)))
df.set_index('date', inplace=True)
print("Original DataFrame:")
display(df)

monthly_mean = df.resample('M').mean()
print("Monthly mean DataFrame:")
display(monthly_mean)

Original DataFrame:

            data
date
2022-01-01    79
2022-01-02     7
2022-01-03    24
2022-01-04    55
2022-01-05    57
...          ...
2022-12-27    78
2022-12-28    96
2022-12-29    95
2022-12-30    20
2022-12-31    44

[365 rows x 1 columns]

Monthly mean DataFrame:

C:\Users\pcslg\AppData\Local\Temp\ipykernel_20800\4057003991.py:9: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  monthly_mean = df.resample('M').mean()

                 data
date
2022-01-31  49.419355
2022-02-28  44.035714
2022-03-31  50.225806
2022-04-30  47.000000
2022-05-31  45.774194
2022-06-30  46.433333
2022-07-31  52.774194
2022-08-31  44.870968
2022-09-30  46.133333
2022-10-31  45.870968
2022-11-30  56.000000
2022-12-31  50.451613

#### Assignment 7: MultiIndex DataFrame

1. Create a Pandas DataFrame with a MultiIndex (hierarchical index). Perform some basic indexing and slicing operations on the MultiIndex DataFrame.
2. Create a Pandas DataFrame with MultiIndex consisting of 'Category' and 'SubCategory'. Fill the DataFrame with random data and compute the sum of values for each 'Category' and 'SubCategory'.

In [12]:
#Task 1
arrays = [['A', 'A', 'B', 'B'], ['one', 'two', 'one', 'two']]
index = pd.MultiIndex.from_arrays(arrays, names=('Category', 'SubCategory'))
df = pd.DataFrame(
    np.random.randint(1, 100, size=(4,3)), 
    index=index,
    columns=['Value1', 'Value2', 'Value3']
)
print("MultiIndex DataFrame:")
display(df)

print("Indexing at Category 'A':")
display(df.loc['A'])

print("Slicing at Category 'B' and SubCategory 'two':")
print(df.loc[('B', 'two')])

MultiIndex DataFrame:

                      Value1  Value2  Value3
Category SubCategory
A        one               9      25      62
         two              69      71      58
B        one              65      89      74
         two              39      85      86

Indexing at Category 'A':

             Value1  Value2  Value3
SubCategory
one               9      25      62
two              69      71      58

Slicing at Category 'B' and SubCategory 'two':
Value1    39
Value2    85
Value3    86
Name: (B, two), dtype: int32

In [16]:
#Task 2
arrays = [['A', 'A', 'B', 'B', 'C', 'C'], ['one', 'two', 'one', 'two', 'one', 'two']]
index = pd.MultiIndex.from_arrays(arrays, names=('Category', 'SubCategory'))
df = pd.DataFrame(np.random.randint(1, 100, size=(6, 4)), index=index, columns=['Value1', 'Value2', 'Value3', 'Value4'])
print("MultiIndex DataFrame:")
display(df)

sum_values = df.groupby(['Category']).sum()
print("Sum of values:")
display(sum_values)

MultiIndex DataFrame:

                      Value1  Value2  Value3  Value4
Category SubCategory
A        one              94      70      77      90
         two              13      91      94      37
B        one              73      96      13      13
         two              34      64      86       2
C        one              84      51      46      15
         two              90      35      55      17

Sum of values:

          Value1  Value2  Value3  Value4
Category
A            107     161     171     127
B            107     160      99      15
C            174      86     101      32

#### Assignment 8: Pivot Tables

1. Create a Pandas DataFrame with columns 'Date', 'Category', and 'Value'. Create a pivot table to compute the sum of 'Value' for each 'Category' by 'Date'.
2. Create a Pandas DataFrame with columns 'Year', 'Quarter', and 'Revenue'. Create a pivot table to compute the mean 'Revenue' for each 'Quarter' by 'Year'.

In [9]:
#Task 1
date_rng = pd.date_range(start='2025-01-01', end='2025-01-10', freq='D')
df = pd.DataFrame({
    'Date':np.random.choice(date_rng, size=20),
    'Category':np.random.choice(['A','B','C'], size=20),
    'Value':np.random.randint(1,100,size=20)
})
print("Original DataFrame:")
display(df)

pivot_table = df.pivot_table(values='Value', index='Date', columns='Category', aggfunc='sum')
print("Pivot Table:")
display(pivot_table)

Original DataFrame:

         Date Category  Value
0  2025-01-01        A     93
1  2025-01-08        A     83
2  2025-01-01        C     56
3  2025-01-08        A     37
4  2025-01-10        A     46
5  2025-01-02        C     31
6  2025-01-10        A     27
7  2025-01-09        B     30
8  2025-01-07        C      1
9  2025-01-10        C     45
10 2025-01-10        C     32
11 2025-01-10        A     20
12 2025-01-08        A     32
13 2025-01-10        A     30
14 2025-01-03        B     64
15 2025-01-05        C     25
16 2025-01-06        C     96
17 2025-01-05        A     18
18 2025-01-04        A     38
19 2025-01-07        C     75

Pivot Table:

Category        A     B     C
Date
2025-01-01   93.0   NaN  56.0
2025-01-02    NaN   NaN  31.0
2025-01-03    NaN  64.0   NaN
2025-01-04   38.0   NaN   NaN
2025-01-05   18.0   NaN  25.0
2025-01-06    NaN   NaN  96.0
2025-01-07    NaN   NaN  76.0
2025-01-08  152.0   NaN   NaN
2025-01-09    NaN  30.0   NaN
2025-01-10  123.0   NaN  77.0

In [12]:
#Task 2
df = pd.DataFrame({
    'Year':np.random.choice([2020, 2021, 2022], size=12),
    'Quarter':np.random.choice(['Q1', 'Q2', 'Q3', 'Q4'], size=12),
    'Revenue':np.random.randint(1, 1000, size=12)
})
print("Original DataFrame:")
display(df)

pivot_table = df.pivot_table(values='Revenue', index='Year', columns='Quarter', aggfunc='mean')
print("Pivot Table:")
display(pivot_table)

Original DataFrame:

    Year Quarter  Revenue
0   2021      Q2       84
1   2021      Q4      928
2   2020      Q1      394
3   2022      Q1      151
4   2022      Q3      547
5   2020      Q1      497
6   2022      Q3      150
7   2022      Q1      115
8   2022      Q3      369
9   2021      Q4      273
10  2020      Q2      495
11  2021      Q2      280

Pivot Table:

Quarter     Q1     Q2          Q3     Q4
Year
2020     445.5  495.0         NaN    NaN
2021       NaN  182.0         NaN  600.5
2022     133.0    NaN  355.333333    NaN

#### Assignment 9: Applying Functions

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Apply a function that doubles the values of the DataFrame.
2. Create a Pandas DataFrame with 3 columns and 6 rows filled with random integers. Apply a lambda function to create a new column that is the sum of the existing columns.

In [15]:
#Task 1
df = pd.DataFrame(
    np.random.randint(1, 100, size=(5,3)),
    columns=['A','B','C']
)
print("Original DataFrame:")
display(df)

df_doubled = df.applymap(lambda x: x * 2)
print("Doubled DataFrame:")
display(df_doubled)

Original DataFrame:

    A   B   C
0  26  95   9
1  28  98  98
2   5  67  26
3  58  49  10
4  97  46  61

Doubled DataFrame:

C:\Users\pcslg\AppData\Local\Temp\ipykernel_25056\888257060.py:9: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_doubled = df.applymap(lambda x: x * 2)

     A    B    C
0   52  190   18
1   56  196  196
2   10  134   52
3  116   98   20
4  194   92  122

In [ ]:
#Task 2
df = pd.DataFrame(
    np.random.randint(1, 100, size=(6,3)),
    columns=['A','B','C']
)
print("Original DataFrame:")
display(df)

df['sum'] = df.apply(lambda row: row.sum(), axis=1)
print("DataFrame with sum column:")
display(df)

Original DataFrame:

    A   B   C
0  51  25  64
1  27  91  38
2  34  22  82
3  70  37  78
4  65  68  69
5  95  38  48

DataFrame with sum column:

    A   B   C  sum
0  51  25  64  140
1  27  91  38  156
2  34  22  82  138
3  70  37  78  185
4  65  68  69  202
5  95  38  48  181

#### Assignment 10: Working with Text Data

1. Create a Pandas Series with 5 random text strings. Convert all the strings to uppercase.
2. Create a Pandas Series with 5 random text strings. Extract the first three characters of each string.

In [25]:
#Task 1
text_data = pd.Series(['apple', 'banana', 'cherry', 'date', 'elderberry'])
print("Original Series:")
display(text_data)

uppercase_data = text_data.str.upper()
print("Uppercase Series:")
display(uppercase_data)

Original Series:

0         apple
1        banana
2        cherry
3          date
4    elderberry
dtype: object

Uppercase Series:

0         APPLE
1        BANANA
2        CHERRY
3          DATE
4    ELDERBERRY
dtype: object

In [26]:
#Task 2
text_data = pd.Series(['apple', 'banana', 'cherry', 'date', 'elderberry'])
print("Original Series:")
print(text_data)

first_three_chars = text_data.str[:3]
print("First three characters:")
print(first_three_chars)

Original Series:
0         apple
1        banana
2        cherry
3          date
4    elderberry
dtype: object
First three characters:
0    app
1    ban
2    che
3    dat
4    eld
dtype: object